import React from "react";
import "./AboutUsSection.css";

const AboutUsSection = () => {
  return (
    <section className="section who-we-are-section">
      <div className="who-we-are-container">
        <div className="who-we-are-text-box">
          <h2 className="about-heading-1">ვინ ვართ ჩვენ?</h2>
          <p className="about-text-1">
            E-სწავლე არის პროდუქტი რომელიც სტუდენტებს, ლექტორებს, კომპანიებსა და
            რექრუითერებს ეხმარება კოლაბორაციაში. თითოეულ სტუდენტს შეუძლია
            გაიაროს თავისი შერჩეული კურსი სრულიად უფასოდ და კურსის წარმატებით
            გავლის შემთხვევაში დასაჩუქრდეს NFT-ით, რომლის გამოყენებაც ამავე
            აპლიკაციაში შეუძლია. რა სარგებელი აქვს კომპანიას? კომპანიას შეუძლია
            ატვირთოს სასურველი პოზიციის შემასწავლელი კურსი, კურსის ბოლოს
            დააწესოს გამოცდა და ის სტუდენტები, რომლებიც მოცემულ კურსს წარმატებით
            გაივლიან განთავსდებიან მოცემული კურსის ლიდერბორდზე. კომპანიას
            შეუძლია ამოირჩიოს საუკეთესოთა შორის საუკეთესო!
          </p>
        </div>
        <div className="our-goal-text-box">
          <h2 className="about-heading-2">როგორ მუშაობს NFT?</h2>
          <p className="about-text-2">
            თითოეული კურსის წარმატებით გავლის შემთხვევაში სტუდენტი დასაჩუქრდება
            NFT-ით. გარდა ამისა სტუდენტს საჩუქრად გადაეცემა ქოინები. გარკვეული
            რაოდენობის მოგროვების შემდეგ სტუდენტს შეუძლია შეგროვებული ქოინები
            გამოიყენოს E-სწავლე-ს პრემიუმ ვერსიის მისაღებად ან რეკრუიტერთან
            გასასაუბრებლად. რეკრუიტერი მას დაეხმარება სასურველი სამსახურის
            მოძიებაში. გარდა ამისა სტუდენტს შეუძლია დონაციის სახით, ქოინების
            სასურველი რაოდენობა გაუგზავნოს ფავორიტ ლექტორს.
          </p>
        </div>
      </div>
    </section>
  );
};

export default AboutUsSection;
